```
DataFrame: employees
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| employee_id | int    |
| name        | object |
| department  | object |
| salary      | int    |
+-------------+--------+
Write a solution to display the first 3 rows of this DataFrame.



Example 1:

Input:
DataFrame employees
+-------------+-----------+-----------------------+--------+
| employee_id | name      | department            | salary |
+-------------+-----------+-----------------------+--------+
| 3           | Bob       | Operations            | 48675  |
| 90          | Alice     | Sales                 | 11096  |
| 9           | Tatiana   | Engineering           | 33805  |
| 60          | Annabelle | InformationTechnology | 37678  |
| 49          | Jonathan  | HumanResources        | 23793  |
| 43          | Khaled    | Administration        | 40454  |
+-------------+-----------+-----------------------+--------+
Output:
+-------------+---------+-------------+--------+
| employee_id | name    | department  | salary |
+-------------+---------+-------------+--------+
| 3           | Bob     | Operations  | 48675  |
| 90          | Alice   | Sales       | 11096  |
| 9           | Tatiana | Engineering | 33805  |
+-------------+---------+-------------+--------+
Explanation:
Only the first 3 rows are displayed.
```

In [2]:
import pandas as pd

## Test Case

In [3]:
data = [
    {"employee_id": 3,  "name": "Bob",       "department": "Operations",            "salary": 48675},
    {"employee_id": 90, "name": "Alice",     "department": "Sales",                 "salary": 11096},
    {"employee_id": 9,  "name": "Tatiana",   "department": "Engineering",           "salary": 33805},
    {"employee_id": 60, "name": "Annabelle", "department": "InformationTechnology", "salary": 37678},
    {"employee_id": 49, "name": "Jonathan",  "department": "HumanResources",        "salary": 23793},
    {"employee_id": 43, "name": "Khaled",    "department": "Administration",        "salary": 40454},
]

df = pd.DataFrame(data)

## First Solution

In [4]:
def select_first_rows(employees: pd.DataFrame) -> pd.DataFrame:
    return employees.head(3)

select_first_rows(df)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805